src/conf/Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаниматьПоВозможности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВозможныхПроцедур</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/conf/Catalogs/Помещения/Ext/ManagerModule.bsl
Функция ПолучитьСписокАктивныхПомещений() Экспорт
	Запрос = Новый Запрос();
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	Помещения.Ссылка,
	               |	Помещения.Наименование,
	               |	Помещения.НеЗаниматьПоВозможности КАК НеЗаниматьПоВозможности,
	               |	Помещения.Код
	               |ИЗ
	               |	Справочник.Помещения КАК Помещения
	               |ГДЕ
	               |	Помещения.Активно = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НеЗаниматьПоВозможности";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьМассивПроцедурПоПомещению(Помещение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПомещенияСписокВозможныхПроцедур.Процедура
	               |ИЗ
	               |	Справочник.Помещения.СписокВозможныхПроцедур КАК ПомещенияСписокВозможныхПроцедур";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Процедура");
КонецФункции
